; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 4447)
	(= (fuel plane1) 1366)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 4)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city2)
	(= (capacity plane2) 9770)
	(= (fuel plane2) 2963)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at person1 city1)
	(at person2 city3)
	(at person3 city1)
	(at person4 city3)
	(at person5 city4)
	(at person6 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 653)
	(= (distance city0 city2) 806)
	(= (distance city0 city3) 733)
	(= (distance city0 city4) 770)
	(= (distance city1 city0) 653)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 650)
	(= (distance city1 city3) 631)
	(= (distance city1 city4) 943)
	(= (distance city2 city0) 806)
	(= (distance city2 city1) 650)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 854)
	(= (distance city2 city4) 526)
	(= (distance city3 city0) 733)
	(= (distance city3 city1) 631)
	(= (distance city3 city2) 854)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 631)
	(= (distance city4 city0) 770)
	(= (distance city4 city1) 943)
	(= (distance city4 city2) 526)
	(= (distance city4 city3) 631)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city3)
	(at person1 city0)
	(at person2 city2)
	(at person3 city2)
	(at person4 city4)
	(at person5 city2)
	(at person6 city3)
	))

(:metric minimize (+ (* 1 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 1306, (fuel plane1) from 1366 to 60
   goals met: 1 of 7
2. (refuel plane2 city2)
   changed: (fuel plane2) from 2963 to 9770
   goals met: 1 of 7
3. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 1306 to 4722, (fuel plane2) from 9770 to 6354
   goals met: 2 of 7
4. (board person2 plane2 city3)
   deleted: (at person2 city3)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 7
5. (board person4 plane2 city3)
   deleted: (at person4 city3)
   added: (in person4 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 7
6. (fly plane2 city3 city4)
   deleted: (at plane2 city3)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 4722 to 7246, (fuel plane2) from 6354 to 3830
   goals met: 1 of 7
7. (debark person4 plane2 city4)
   deleted: (in person4 plane2)
   added: (at person4 city4)
   changed: (onboard plane2) from 2 to 1
   goals met: 2 of 7
8. (board person5 plane2 city4)
   deleted: (at person5 city4)
   added: (in person5 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 7
9. (fly plane2 city4 city2)
   deleted: (at plane2 city4)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 7246 to 9350, (fuel plane2) from 3830 to 1726
   goals met: 2 of 7
10. (debark person2 plane2 city2)
   deleted: (in person2 plane2)
   added: (at person2 city2)
   changed: (onboard plane2) from 2 to 1
   goals met: 3 of 7
11. (debark person5 plane2 city2)
   deleted: (in person5 plane2)
   added: (at person5 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 4 of 7
12. (refuel plane2 city2)
   changed: (fuel plane2) from 1726 to 9770
   goals met: 4 of 7
13. (zoom plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 9350 to 18744, (fuel plane2) from 9770 to 376
   goals met: 5 of 7
14. (refuel plane1 city0)
   changed: (fuel plane1) from 60 to 4447
   goals met: 5 of 7
15. (zoom plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 18744 to 21356, (fuel plane1) from 4447 to 1835
   goals met: 5 of 7
16. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 5 of 7
17. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 7
18. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 21356 to 22662, (fuel plane1) from 1835 to 529
   goals met: 5 of 7
19. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 7
20. (refuel plane1 city0)
   changed: (fuel plane1) from 529 to 4447
   goals met: 6 of 7
21. (zoom plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 22662 to 25886, (fuel plane1) from 4447 to 1223
   goals met: 6 of 7
22. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (at person3 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 7
